{
    "subject": "resource/Separate_Baptists",
    "predicate": "ontology/abstract",
    "object": "The Separate Baptists were an 18th-century group of Baptists in the United States, primarily in the South, that grew out of the Great Awakening.The Great Awakening was a religious revival and revitalization of piety among the Christian churches. It covered English-speaking countries and swept through the American colonies between the 1730s and the 1770s. Three important preachers of the times were Gilbert Tennent (1703–65), Jonathan Edwards (1703–58), and George Whitefield (1714–70). The Separate Baptists are most directly connected to Whitefield's influence. The first identifiable congregation of Separate Baptists was formed in Boston, Massachusetts. Whitefield preached in Boston in 1740. The pastor of the Baptist church disapproved of the revival excitement, while several members approved of it and became discontented with the pastor's ministry. They withdrew from the First Baptist Church and formed Second Baptist Church in 1743.The Great Awakening served to both invigorate and divide churches. Many denominations divided into Old Lights — holding a low view of the revivalism, and sometimes directly opposing it — and New Lights — who enthusiastically embraced it. Many New Lights felt that the old ways had allowed too many unconverted church members, and by the end of the 1740s some of the New Lights believed the established churches could not be reformed from within and withdrew from them. A favorite verse among them was II Corinthians 6:17 — \"Come out from among them, and be ye separate.\" This led to them being called Separate.A growing body of Separate Baptists began in New England. They were zealous in evangelism and held to heart-felt religion. The most prominent New England pastor and congregation was Isaac Backus (1724–1808) and the church at Middleborough, Massachusetts. Backus was raised a Congregationalist and became a New Light (or Separatist) Congregational pastor in 1748. After conversion to Baptist views on the doctrine of baptism, Backus and others formed a Baptist congregation in 1756. Backus was very active in the fight for religious liberty in America. The Separate Baptists of New England were never truly a separate group from the Regular Baptists. It would remain for the Separate Baptists in the South to develop along distinct lines.In 1745 Shubal Stearns (1706–71), a member of the Congregational church in Tolland, Connecticut, heard evangelist George Whitefield. Stearns was converted and adopted the Awakening's view of revival and conversion. Stearns' church became involved in a controversy over the proper subjects of baptism in 1751. Soon Stearns rejected infant baptism and sought baptism at the hands of Wait Palmer, Baptist minister of Stonington, Connecticut. By March, Shubal Stearns was ordained into the ministry by Palmer and Joshua Morse, the pastor of New London, Connecticut. The next twenty years of Stearns' remarkable ministry is inextricably intertwined with the rise and expansion of the Separate Baptists.In 1754, Stearns moved south to Opequon, Virginia. Here he joined Daniel Marshall and wife Martha (Stearns' sister), who were already active in a Baptist church there. On November 22, 1755, Stearns and his party moved further south to Sandy Creek, in Guilford County, North Carolina. This party consisted of eight men and their wives, mostly relatives of Stearns. Stearns pastored at Sandy Creek until his death. From there, Separate Baptists spread in the South. The church quickly grew from 16 members to 606. Church members moved to other areas and started other churches. The Sandy Creek Association was formed in 1758. Morgan Edwards, Baptist minister and historian contemporary with Stearns, recorded that, \"in 17 years, [Sandy Creek] has spread its branches westward as far as the great river Mississippi; southward as far as Georgia; eastward to the sea and Chesopeck [sic] Bay; and northward to the waters of the Pottowmack [sic]; it, in 17 years, is become mother, grandmother, and great grandmother to 42 churches, from which sprang 125 ministers.\"For a time these Baptists remained somewhat distinct from the Regular Baptists. They were in the main in agreement with the Regulars, but holding to some minor points of difference. According to Edwards, \"These are called Separates, not because they withdrew from the Regular-baptists but because they have hitherto declined any union with them. The faith and order of both are the same, except some trivial matters not sufficient to support a distinction, but less a disunion; for both avow the Century-Confession and the annexed discipline.\"One distinction was in the number of ordinances or rites observed by the Separates. The nine rites were baptism, the Lord's supper, love feasts, laying on of hands, washing feet, anointing the sick, the right hand of fellowship, kiss of charity, and devoting children. Not all the churches practiced all nine of these, but most churches practiced more than the two ordinances generally held by the Regular Baptists — baptism and the Lord's supper.With the exception of the Separate Baptists in Christ, the denominational name Separate Baptist disappeared in many areas of the country with the formal and informal agreements of union between the Regular Baptists and Separate Baptists, beginning in Virginia in 1787, in the Carolinas in 1789, and in Kentucky in 1797 & 1801. As recorded by Benedict, the conclusion of the terms of union in Virginia stated, \"...we are united, and desire hereafter, that the names Regular and Separate be buried in oblivion; and that from henceforth, we shall be known by the name of the United Baptist Churches, in Virginia.\"Descendants of the Separate Baptists include the Separate Baptists in Christ, Landmark Missionary Baptists, Primitive Baptists, Southern Baptists, United Baptists, and The General Association of Baptists.Separate Baptists are particularly visible in Kentucky, where a member of the denomination, Vernie McGaha of Russell Springs, served in the state senate.",
    "human_readable": "The abstract of Separate Baptists is 'The Separate Baptists were an 18th-century group of Baptists in the United States, primarily in the South, that grew out of the Great Awakening.'",
    "questions": [
        {
            "score": 0.953723132610321,
            "question": "Where were the Separate Baptists primarily located in the United States?"
        },
        {
            "score": 0.9249224066734314,
            "question": "What century saw the emergence of the Separate Baptists?"
        },
        {
            "score": 0.9192182421684265,
            "question": "Were the Separate Baptists a widespread movement across the United States?"
        },
        {
            "score": 0.9058524966239929,
            "question": "What was the significance of the Great Awakening in relation to the Separate Baptists?"
        },
        {
            "score": 0.8913853168487549,
            "question": "When did the Separate Baptists emerge?"
        },
        {
            "score": 0.8649964332580566,
            "question": "Can you describe the origins of the Separate Baptists?"
        },
        {
            "score": 0.8453136086463928,
            "question": "To what religious denomination did the Separate Baptists belong?"
        },
        {
            "score": 0.791624128818512,
            "question": "What historical event influenced the rise of the Separate Baptists?"
        },
        {
            "score": 0.7913658022880554,
            "question": "Besides being Baptists, what other defining features characterized the Separate Baptists?"
        },
        {
            "score": 0.768783450126648,
            "question": "What is described as the primary characteristic of the Separate Baptists?"
        }
    ],
    "google_pages": [
        {
            "url": "https://www.google.com/search?q=The abstract of Separate Baptists is 'The Separate Baptists were an 18th-century group of Baptists in the United States, primarily in the South, that grew out of the Great Awakening.'",
            "html": "dbpedia_5511_0.html"
        },
        {
            "url": "https://www.google.com/search?q=Besides being Baptists, what other defining features characterized the Separate Baptists?",
            "html": "dbpedia_5511_1.html"
        },
        {
            "url": "https://www.google.com/search?q=What historical event influenced the rise of the Separate Baptists?",
            "html": "dbpedia_5511_2.html"
        },
        {
            "url": "https://www.google.com/search?q=To what religious denomination did the Separate Baptists belong?",
            "html": "dbpedia_5511_3.html"
        }
    ],
    "selected_docs": [
        {
            "file_id": "dbpedia_5511_101.txt"
        },
        {
            "file_id": "dbpedia_5511_11.txt"
        },
        {
            "file_id": "dbpedia_5511_110.txt"
        },
        {
            "file_id": "dbpedia_5511_138.txt"
        },
        {
            "file_id": "dbpedia_5511_26.txt"
        },
        {
            "file_id": "dbpedia_5511_31.txt"
        },
        {
            "file_id": "dbpedia_5511_40.txt"
        },
        {
            "file_id": "dbpedia_5511_59.txt"
        },
        {
            "file_id": "dbpedia_5511_81.txt"
        },
        {
            "file_id": "dbpedia_5511_91.txt"
        }
    ],
    "final_question": "Is true?",
    "responses": {
        "gemma2": {
            "short_ans": 1,
            "full_ans": "```json\n{'output': 'yes'}\n``` \n\n\nLet me know if you'd like to evaluate any more triples! \n"
        },
        "llama3.1": {
            "short_ans": 1,
            "full_ans": "Based on the context information provided, here's my evaluation:\n\n**Query:** The Separate Baptists emerged from the First Great Awakening.\n**Response:** {'output': 'yes'}\n\nThe documents provide evidence that the Separate Baptists were indeed an 18th-century group of Baptists in the United States, primarily in the South, that grew out of the Great Awakening. Specifically, file_path: /Users/stefanomarchesin/Research/fshami/Rag/docs/dbpedia_5511/re-ranker-msmarco/54.txt mentions that \"The Separate Baptist faith was organized in Boston, Massachusetts, arising out of the Great Awakening...\"\n\n**Query:** The Separate Baptists rejected modern methods which included missionary and educational auxiliaries seminaries, and temperance societies of the church.\n**Response:** {'output': 'yes'}\n\nThis is also supported by file_path: /Users/stefanomarchesin/Research/fshami/Rag/docs/dbpedia_5511/re-ranker-msmarco/54.txt, which states that \"From the Separate Baptist faith came the Regular Baptists who rejected 'modern' methods...\"\n\n**Query:** The Separate Baptists were a distinct minority within Baptist life in the South.\n**Response:** {'output': 'yes'}\n\nFile_path: /Users/stefanomarchesin/Research/fshami/Rag/docs/dbpedia_5511/re-ranker-msmarco/11.txt mentions that \"Primitive Baptists in the South were birthed in the early 1800s... although they attained notable prominence and influence in some southeastern states, especially in the 1830s to the 1850s, they nonetheless remained a distinct minority within Baptist life in the South.\"\n\nSo, all three statements are supported by the provided context information."
        },
        "qwen2.5": {
            "short_ans": 0,
            "full_ans": "```json\n{\n  \"output\": \"no\"\n}\n```\n\nExplanation: The provided documents do not directly state that the Separate Baptists were an 18th-century group. While they mention the Great Awakening (which occurred during the 18th century) and the formation of certain Baptist groups in the early to mid-1800s, there is no explicit confirmation that \"Separate Baptists\" specifically refer to a 18th-century group within the documents provided."
        },
        "mistral": {
            "short_ans": 1,
            "full_ans": " {'output': 'yes'}"
        }
    },
    "need_tiebreaker": false,
    "tiebreakers_responses": {
        "qwen2.5:14b": {},
        "llama3.1:70b": {}
    },
    "final_decision": 1,
    "actual_decision": 1,
    "analysis": {
        "stratum": "Popular",
        "topic": "-"
    },
    "errors": {
        "qwen2.5": {
            "reason": "The Separate Baptists emerged during the Great Awakening in New England in the 1730s-1740s, and later spread to the South. They were not primarily a Southern group from the start, and their formation predates the Southern Baptist Convention by several decades.",
            "category": 2
        }
    }
}